sslivins/arctic-controller/sdkconfig.defaults
# Arctic Heat Pump Controller - ESP32-P4 Tab5 Configuration

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Main task stack - needs headroom for LVGL deep layout/font measurement chains
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Home Assistant local-push transport and device feasibility tests
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y
CONFIG_LWIP_MAX_SOCKETS=24
# Test instrumentation is enabled only by device-tests.yml.
CONFIG_TEST_ENDPOINTS=n

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# Enable XIP from PSRAM - allows PSRAM reads (display framebuffer) to continue
# during SPI flash writes (OTA updates), preventing display flicker
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# ESP-Hosted WiFi Configuration (ESP32-C6 co-processor via SDIO)
# Using esp_hosted 1.4.0 to match M5Stack Tab5's pre-flashed C6 firmware
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
# Tab5 SDIO GPIOs for ESP32-C6 (from M5Stack docs and their demo sdkconfig)
# CLK=12, CMD=13, D0=11, D1=10, D2=9, D3=8, RST=15
# Note: esp_hosted 1.4.0 uses different symbol names than 2.11.x
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
# Note: Tab5 ESP32-C6 comes pre-flashed with WiFi SDIO firmware v1.4.1

# WiFi performance - keep IRAM optimizations enabled (device is always-on, plugged in)
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
# Sleep optimization not needed - device never sleeps
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n

# Disable WiFi power save for consistent low-latency API responses
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# WPA Supplicant memory optimizations
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_SAE_PK=n
CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n

# Reduce WiFi buffers to save memory
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# mbedTLS optimizations - need larger buffers for GitHub HTTPS/TLS
# Allocate mbedTLS buffers in PSRAM (32MB available) to avoid exhausting
# the ~200KB of internal RAM during TLS handshakes
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Move FreeRTOS functions from IRAM to flash
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# Reduce HAL IRAM usage
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=0

# Disable mbedTLS hardware acceleration IRAM placement
CONFIG_MBEDTLS_HARDWARE_AES=n
CONFIG_MBEDTLS_HARDWARE_SHA=n

# Newlib nano formatting - reduces code size
CONFIG_NEWLIB_NANO_FORMAT=y

CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# System event callbacks remain lightweight; API startup has its own task.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# LVGL Configuration
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_PERF_MONITOR=y
# Enable IRAM for LVGL fast memory - device is always-on, optimize for smooth UI
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
# LVGL uses a custom allocator (main/lv_mem_psram.c) that draws widget memory
# from PSRAM instead of the ~180 KB internal RAM. Needed because the persistent
# tab shell keeps all four tab trees resident, which overflowed the internal
# builtin pool when a second full screen (Settings) was loaded on top.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_MEM_SIZE_KILOBYTES=128

# Display Configuration
# Use 2 DPI frame buffers for hardware double-buffering
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2

# Fonts - Reduced set to save code space
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y

# Screenshot support (test endpoint captures display as PNG)
CONFIG_LV_USE_SNAPSHOT=y
# CONFIG_LV_USE_LODEPNG is not set

CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Certificate bundle for HTTPS (required for OTA from GitHub)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# HTTPS server (TLS on port 443)
CONFIG_ESP_HTTPS_SERVER_ENABLE=y

# OTA Rollback Protection
# When enabled, after an OTA update the bootloader marks the new partition as
# ESP_OTA_IMG_PENDING_VERIFY.  The firmware must call esp_ota_mark_app_valid()
# before the next reboot; otherwise the bootloader rolls back to the previous
# working partition.  This prevents a bad OTA from bricking the device.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- OTA flash-erase watchdog mitigations (ESP32-P4 host + esp_hosted C6 SDIO) ---
# On ESP32-P4 (RISC-V) a SPI-flash erase clears MIE globally, masking ALL
# interrupts (even IRAM ISRs) for the whole erase duration. A 64KB block erase
# (hundreds of ms .. ~2s worst case) starves the esp_hosted SDIO-RX servicing
# and blows the stock 300ms interrupt watchdog -> rst:0x7 (HP_SYS_HP_WDT_RESET),
# bricking the device mid-OTA. Force per-4KB-sector erases (short blackouts),
# yield between erases, and give both watchdogs generous headroom so a legitimate
# flash-erase blackout during an OTA download does not trip a reset. Device is
# mains-powered/always-on, so the larger WDT windows are an acceptable tradeoff.
CONFIG_SPI_FLASH_BYPASS_BLOCK_ERASE=y
CONFIG_SPI_FLASH_YIELD_DURING_ERASE=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=8000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
